<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"4ae3ca9a6ae175d8940590585fdcbfd4ed6f19badc2f33794aeac4cffc744766","plan_job_ref":"Job Create terraform plan #2 at https://github.com/presentium/infrastructure/actions/runs/9909030244","plan_out_hash":"5b2f99698c667c1ef6100226192234f298e75b26647783e8a55947e52c727220","plan_hash":"2a3b9972cc056a3b4ece1419e1c28a2790a8b4cdf584f9cf46daac0abbe5403a","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloudflare.cloudflare_zone_settings_override.main-settings will be created
+   resource "cloudflare_zone_settings_override" "main-settings" {
+       id                       = (known after apply)
+       initial_settings         = (known after apply)
+       initial_settings_read_at = (known after apply)
+       readonly_settings        = (known after apply)
+       zone_id                  = "********************************"
+       zone_status              = (known after apply)
+       zone_type                = (known after apply)

+       settings {
+           always_online               = (known after apply)
+           always_use_https            = "on"
+           automatic_https_rewrites    = "on"
+           binary_ast                  = (known after apply)
+           brotli                      = (known after apply)
+           browser_cache_ttl           = (known after apply)
+           browser_check               = (known after apply)
+           cache_level                 = (known after apply)
+           challenge_ttl               = (known after apply)
+           ciphers                     = (known after apply)
+           cname_flattening            = (known after apply)
+           development_mode            = (known after apply)
+           early_hints                 = (known after apply)
+           email_obfuscation           = (known after apply)
+           filter_logs_to_cloudflare   = (known after apply)
+           fonts                       = (known after apply)
+           h2_prioritization           = (known after apply)
+           hotlink_protection          = (known after apply)
+           http2                       = (known after apply)
+           http3                       = (known after apply)
+           image_resizing              = (known after apply)
+           ip_geolocation              = (known after apply)
+           ipv6                        = (known after apply)
+           log_to_cloudflare           = (known after apply)
+           max_upload                  = (known after apply)
+           min_tls_version             = "1.1"
+           mirage                      = (known after apply)
+           opportunistic_encryption    = (known after apply)
+           opportunistic_onion         = (known after apply)
+           orange_to_orange            = (known after apply)
+           origin_error_page_pass_thru = (known after apply)
+           origin_max_http_version     = (known after apply)
+           polish                      = (known after apply)
+           prefetch_preload            = (known after apply)
+           privacy_pass                = (known after apply)
+           proxy_read_timeout          = (known after apply)
+           pseudo_ipv4                 = (known after apply)
+           response_buffering          = (known after apply)
+           rocket_loader               = (known after apply)
+           security_level              = (known after apply)
+           server_side_exclude         = (known after apply)
+           sort_query_string_for_cache = (known after apply)
+           ssl                         = "strict"
+           tls_1_2_only                = (known after apply)
+           tls_1_3                     = "on"
+           tls_client_auth             = (known after apply)
+           true_client_ip_header       = (known after apply)
+           universal_ssl               = (known after apply)
+           visitor_ip                  = (known after apply)
+           waf                         = (known after apply)
+           webp                        = (known after apply)
+           websockets                  = (known after apply)
+           zero_rtt                    = (known after apply)

+           minify (known after apply)

+           mobile_redirect (known after apply)

+           nel (known after apply)

+           security_header (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #2](https://github.com/presentium/infrastructure/actions/runs/9909030244)